{"config": [{"config": {"batch_input_shape": [null, 5, 5, 2048], "dtype": "float32", "trainable": true, "name": "global_average_pooling2d_3", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"units": 500, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_5", "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"units": 300, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_6", "trainable": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"units": 133, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_7", "trainable": true, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}