{"config": [{"config": {"batch_input_shape": [null, 5, 5, 2048], "trainable": true, "name": "global_average_pooling2d_3", "dtype": "float32", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_5", "units": 500}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_6", "units": 300}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_7", "units": 133}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}